#!/usr/bin/python
# -*- coding: utf-8 -*-
import emoji


def emoj(sign, alias=False):
    return emoji.emojize(sign, alias).encode('utf-8')


def get_question(index):
    global QUESTIONS
    print "## index = %s ##" % index
    return QUESTIONS[int(index)]


def get_options():
    global OPTIONS
    return OPTIONS


def get_feedback(fb_num, answers):
    global FEEDBACK
    scores = get_scores(answers)
    if fb_num == 1:
        j = feedback_range([1, 6], scores)
        return j, FEEDBACK[0][j]
    elif fb_num == 2:
        j = feedback_range([2, 7], scores)
        return j, FEEDBACK[1][j]
    elif fb_num == 3:
        j = feedback_range([3, 8], scores)
        return j, FEEDBACK[2][j]
    elif fb_num == 4:
        j = feedback_range([4, 9], scores)
        return j, FEEDBACK[3][j]
    elif fb_num == 5:
        j = feedback_range([5, 10], scores)
        return j, FEEDBACK[4][j]


def feedback_range(li, scores):
    res = 0
    for j in li:
        res += scores[j - 1]
    print "## scores for questions %s = %i ##" % (li, res)
    if res in range(2, 5):
        return 0
    elif res in range(5, 8):
        return 1
    elif res in range(8, 11):
        return 2


def get_scores(answers):
    scores = []
    for j in range(0, len(answers)):
        p = 0
        if j + 1 in (1, 3, 4, 5, 7):
            p += int(answers[j])
        else:
            p += 6 - int(answers[j])
        scores.append(p)
    return scores


# Constants
# Info
USER_INFO_QUESTIONS = list()
USER_INFO_QUESTIONS.append('جنسیت خود را مشخص کنید')
USER_INFO_QUESTIONS.append('چند سال دارید؟')

# Questions
QUESTIONS = []
q = [''] * 10
q[0] = '۱- آدم محتاط و کم حرفی هستم.'
q[1] = '۲- معمولاً به دیگران اعتماد می‌کنم.'
q[2] = '۳- خودم را آدم تنبلی می‌دانم.'
q[3] = '۴- به ندرت احساس اضطراب يا ترس مي كنم.'
q[4] = '۵- خیلی به هنر علاقه ندارم.'
q[5] = '۶- اجتماعی و معاشرتی هستم و از دیدن آدمهای جدید خوشحال می‌شوم.'
q[6] = '۷- تلاش می‌کنم با کمک دیگران نقص­هایم را برطرف کنم.'
q[7] = '۸- کارم را همیشه تا آخر انجام می­دهم.'
q[8] = '۹- اغلب از طرز برخورد ديگران با خودم عصباني مي شوم.'
q[9] = '۱۰- تخیل کردن را دوست دارم و تخیل فعالی دارم.'
for item in q:
    QUESTIONS.append(item)

# Options
OPTIONS = dict()
o = [''] * 5
o[0] = 'کاملاً موافق'
o[1] = 'موافق'
o[2] = 'متوسط'
o[3] = 'مخالف'
o[4] = 'کاملاً مخالف'
# o[5] = 'بازگشت به منوی اصلی'
for i, item in enumerate(o):
    OPTIONS[i + 1] = item

# Feedback
FEEDBACK = []
for i in range(0, 5):
    FEEDBACK.append([])
    FEEDBACK[i] = ['', '', '']

header_0 = "شما درون‌گرا هستید یا برون‌گرا؟"
# footer_0 = "{0}\n{1}".format("*آیا می‌دانید بهتر است با یک درون‌گرا ازدواج کنید یا یک برون‌گرا؟", "با ما همراه شوید")
FEEDBACK[0][0] = (
    header_0 + "\n\n" +
    "نتیجه تست شما نشان می‌دهد، آدم درون‌گرایی هستید. این یعنی تنهایی را بیشتر دوست دارید و ترجیح می‌دهید کارها را بدون حضور دیگران انجام‌دهید. " +
    "همچنین شما دوست دارید مدت زیادی را صرف فکر کردن، کنید؛ بنابراین اتاق یا کنج خلوت‌تان را با هیچ‌چیز عوض نخواهید کرد. " +
    "یادتان باشد، شما توانایی‌های شگفت‌انگیزی دارید! مهارت گوش‌کردن، تنها یکی از این توانایی‌هاست." + "\n"
)
FEEDBACK[0][1] = (
    header_0 + "\n\n" +
    "شما نه کاملا درون‌گرا هستید و نه کاملا برون‌گرا. بعضی وقت ها با جمع بودن را ترجیح می‌دهید و دوست دارید مهمانی بروید. " +
    "گاهی هم تنهایی را می‌پسندید و بدتان نمی‌آید در گوشه‌ای نشسته با یک فنجان چای از خودتان پذیرایی کنید." + "\n"
)
FEEDBACK[0][2] = (
    header_0 + "\n\n" +
    "نتیجه تست شما نشان می‌دهد شما آدم برون‌گرایی هستید؛ این یعنی با جمع بودن را دوست دارید. " +
    "دوست دارید حتی کارهایی را که می‌شود تنهایی انجام داد، با جمع انجام دهید. " +
    "یکی از توانایی‌های شگفت‌انگیز شما این است که به راحتی می‌توانید دوستان جدیدی پیدا کنید و به سرعت خودتان را با افراد یک گروه جدید وفق دهید." + "\n"
)

header_1 = "چقدر سازگار هستید؟"
FEEDBACK[1][0] = (
    header_1 + "\n\n" +
    "در حقیقت برای شما نظر دیگران اهمیت زیادی ندارد. یعنی ممکن است با کمال دقت، به حرف‌های پدر، دوست یا هم‌کلاسی‌تان گوش دهید اما نهایتاً کار خودتان را می‌کنید! " +
    "همین خصلت شما برای گروه‌های دوستان، گروه‌های کاری و خانوادگی چندان خوشایند نیست و به‌طورکلی شما برای زندگی سازگارانه در جمع آفریده نشده اید! " +
    "پیشنهاد می‌کنیم از تجارب دیگران استفاده کنید. به قول قدیمی‌ترها «آزموده را آزمودن، خطاست.»" + "\n"
)
FEEDBACK[1][1] = (
    header_1 + "\n\n" +
    "نتیجه این آزمون درمورد میزان سازگاری شما نشان می‌دهد که در بعضی از موارد ترجیح می دهید دیگران را در نظر بگیرید و در بعضی موارد نه! " +
    "و این مساله احتمالا به موقعیت شما بستگی دارد. ممکن است در محل کار آدم سازگاری باشید و نظرات رئیستان را با دقت در کار اعمال کنید؛ " +
    "اما لزوماً در خانه، با همسر یا پدر و مادرتان سازگاری ندارید و حرف حرفِ خودتان است؛ که این مساله کار را برای شما و دیگران سخت‌تر خواهد کرد." + "\n"
)
FEEDBACK[1][2] = (
    header_1 + "\n\n" +
    "نتیجه آزمون شما می‌گوید شما آدم مردم‌داری هستید. " + emoj(':smiley:', True) + "\n" +
    "نظر اطرافیان‌تان برای شما بسیار اهمیت دارد. این خصلت شما بسیار خوب است؛ البته تا زمانی که تبدیل به زندگی کردن برای دیگران نشود. " +
    "برای شما خیلی مهم است که دیگران چه فکری درمورد شما می‌کنند. جمع دوستان و خانواده از بودن با شما خیلی لذت می‌برند، چون شما هوای آنها را دارید. مراقب باشید تا افسار زندگی خود را از دست ندهید!" + "\n"
)

header_2 = "شما مسئولیت‌پذیرید؟"
# footer_2 = "{0}\n{1}".format("دوست دارید بدانید با همسر آینده‌تان، ارتباطتان چطور خواهد بود؟", "با ما باشید!")
FEEDBACK[2][0] = (
    header_2 + "\n\n" +
    "بر اساس این آزمون، شما چندان آدم وظیفه شناس و مسئولیت‌پذیری نیستید. بهتر است در مورد تصمیمات و نحوه رفتارتان در محیط کار کمی تجدید نظر کنید. " +
    "شاید به همین خاطر است که هنوز به رتبه یا کار مورد علاقه‌تان دست نیافته‌اید. نگران نباشید! " +
    "تنها با اندکی تلاش برای تغییر عادت، همه مشکلات ناشی از این مساله را پشت سرخواهید گذاشت." + "\n"
)
FEEDBACK[2][1] = (
    header_2 + "\n\n" +
    "نتایج این آزمون نشان می‌دهد، شما فرد مسئولیت پذیری هستید. به همین خاطر در محل کار و همکارانتان با خیال راحت، کارها را به شما واگذار می‌کنند. " +
    "در محیط خانه هم پدر، مادر یا همسر شما هم می‌دانند که اگر به انجام کاری بله گفته باشید، سعی می‌کنید تا انتها آن را به انجام برسانید. " +
    "همین مساله شما را فردی قابل اطمینان می‌کند. " + "\n" +
    "تبریک " + emoj(':smiley:', True) + "\n"
)
FEEDBACK[2][2] = (
    header_2 + "\n\n" +
    "نتیجه تست شما این‌طور نشان می‌دهد که شما آدم با وجدان، وظیفه شناس و مسئولیت پذیری هستید. به این معنی است که وقتی مسئولیت انجام کاری را می‌پذیرید، " +
    "به بهترین نحو و تا انتها آن را به انجام می‌رسانید و در کارتان کوتاهی و سهل‌انگاری نمی‌کنید. " +
    "کم‌فروشی و بی‌اعتنایی به درست انجام‌شدن کارها را اصلا نمی‌توانید تحمل کنید؛ برای همین در محل کار و جمع خانواده تان روی حرف شما خیلی حساب می کنند." + "\n"
)

header_3 = "آیا شما افسرده هستید؟"
# footer_3 = "با ما باشید!"
FEEDBACK[3][0] = (
    header_3 + "\n\n" +
    "خوشبختانه شما آدمی هستید که هیجانات پایداری دارید. این به این معناست که دمدمی مزاج نیستید؛ و علاوه بر آن اضطراب، " +
    "افسردگی و استرس را کمتر به خانه ذهنتان راه می دهید. این باعث می‌شود احتمال ابتلا به بیماری افسردگی شما کمتر از دیگران شود. " +
    "از این بابت خوش‌شانس هستید! " + emoj(':smiley:', True) + "\n"
)
FEEDBACK[3][1] = (
    header_3 + "\n\n" +
    "نتیجه این آزمون، بیانگر آن است که شما گاهی سرشار از خوشحالی و آرامش هستید و گاهی هم ناآرام و ناراحتید. " +
    "ممکن است صبح یک روز، از قدم زدن در آفتاب لذت ببرید و روز دیگر چشم دیدن خورشید را نداشته باشید. این مساله ناشی از آن است که گاهی هیجانات‌تان پایدار است و گاهی نه! " +
    "بهتر است با شناخت بهتر خودتان و تغییر عادات، تلاش کنید تا از افسردگی در امان بمانید." + "\n"
)
FEEDBACK[3][2] = (
    header_3 + "\n\n" +
    "مراقب باشید!" + "\n" +
    "نتیجه تست شما، نشان می‌دهد اضطراب شما زیاد است و احتمال دارد با زندگی‌تان با افسردگی همراه باشد. " +
    "خشم‌های درونی‌تان را روی هم تل انبار نکنید و سعی کنید آنها را کنترل کنید. روی هم رفته آدم مضطربی هستید. " +
    "درست است که تغییر عادات و شخصیت، به زمان زیاد و طولانی نیاز دارد؛ اما غیرممکن نیست. شما می‌توانید!" + "\n"
)

header_4 = "چقدر محافظه‌کارید؟!"
footer_4 = "اجتماعی باشید! آزمون را برای دوستان و شریک‌تان هم ارسال کنید. " + emoj(':smiley:', True) + "\n"
FEEDBACK[4][0] = (
    header_4 + "\n\n" +
    "نتیجه این آزمون نشان می‌دهد که شما خیلی اهل هنر نیستید؛ شاید از فاصله دور، نیم‌نگاهی به آثار هنری انداخته باشید " +
    "اما به هیچ عنوان حاضر نیستید بعدازظهرتان را با دیدن یک گالری نقاشی بگذرانید. سفر کردن هم چندان مورد علاقه شما نیست و با تجربه‌های جدید اصلا میانه‌ای نداید." + "\n" +
    "دوست دارید چیزهای موجود در زندگیتان را حفظ کنید. به احتمال خیلی زیاد، دوست ندارید رستوران مورد علاقه‌تان را هم عوض کنید. شما یک محافظه‌کار تمام عیارید!" + "\n\n" +
    footer_4
)
FEEDBACK[4][1] = (
    header_4 + "\n\n" +
    "این آزمون می‌گوید شما میانه‌رو هستید!" + "\n" +
    "هم دوست‌دارید در رستوران همیشگی‌تان غذا بخورید، هم به کافه‌های تازه و جدید سری بزنید. نه کسی هستید که کاملا محافظه کار است و نه از تجربه چیزهای جدید بدتان می آید. " +
    "گه گاهی دلتان می‌خواهد به یک کشور دور در اروپا سفر کنید و گاهی هم نظرتان این است که هیچ کجا خانه آدم نمی‌شود؛ خلاصه که گاهی به این تمایل دارید و گاهی به آن." + "\n\n" +
    footer_4
)
FEEDBACK[4][2] = (
    header_4 + "\n\n" +
    "شما عاشق تجربه‌های جدید و تازه‌اید! از آن دسته آدم‌هایی که تا اسم سفر به میان می‌آید، سرجایشان بند نمی‌شوند. اگر اهل هنر هستید و می‌توانید ساعت‌ها در گالری‌های نقاشی وقت بگذرانید. " +
    "اگر به تکنولوژی‌های جدید علاقه دارید، احتمالا با به بازار آمدن یک گوشی جدید، ته دلتان چیزی شما را قلقلک می‌دهد تا هرچه سریعتر، آن را بخرید!" + "\n" +
    "شما عشق سفر هستید. عشق چیزهای جدید. حالا بستگی به علاقه تان دارد ممکن است داستان های جدید از تلفن همراه برای شما جذاب‌تر باشد!" + "\n\n" +
    footer_4
)

my_very_big_string = (
    "For a long time I used to go to bed early. Sometimes, "
    "when I had put out my candle, my eyes would close so quickly "
    "that I had not even time to say “I’m going to sleep.”"
)

welcome_msg = (
    ""
    ""
    ""
)

duplicate_answer_warning1 = emoj(
    ':triangular_flag_on_post:') + " همراه عزيز، لطفاً تنها يك گزينه را براي هر گزاره انتخاب كنيد."
duplicate_answer_warning2 = emoj(':busstop:', True) + "همراه عزيز، لطفاً تنها يك گزينه را براي هر گزاره انتخاب كنيد."

# info_complete = 'اطلاعات شما را دریافت کردم. حالا می‌توانیم برویم سراغ اولین آزمون. در این آزمون من برای شما ۱۰ گزاره که توسط تیم روانشناسان روان‌یار طراحی شده‌اند، ارسال می‌کنم. کافیست شما پس از هرگزاره، نظرتان را با انتخاب یکی از گزینه‌ها، برای من بفرستید. آماده‌اید؟ پس شروع کنید!'
info_complete = "«آزمون تصوير خود آگاه من»" + "\n\n"
info_complete += (emoj(':dart:', True) + "هدف آزمون:" + "\n")
info_complete += ("در این آزمون شما با تصوری که از خودتان دارید، آشنا می‌شوید." + "\n\n")
info_complete += (emoj(':vertical_traffic_light:') + " راهنماي آزمون:" + "\n")
info_complete += ("در آزمون «تصویر خودآگاه من» برای شما ده گزاره آماده کرده‌ایم. ")
info_complete += (
    "کافیست آن‌ها را بخوانید و نظرتان را درمورد هرکدام با انتخاب یکی از کلیدهای «کاملاً مخالف»، «مخالف»، «متوسط»، «موافق»، «کاملاً موافق» بیان کنید. ")
info_complete += ("در پایان، پاسخ‌های شما، توسط روان‌یارها تحلیل شده و برای شما ارسال می‌شود." + "\n\n")
# info_complete += (
# "برای دقیق‌تر بودن تحلیل آزمون، نیاز است جنسیت و سال تولدتان را بدانیم. خیالتان آسوده! اطلاعات شما نزد ما امانت است و تمام تلاشمان را برای حفظ آن انجام می‌دهیم. تنها خود شما به اطلاعاتتان دسترسي خواهيد داشت." + "\n")
info_complete += ("آماده ايد؟ پس دكمه «آزمون تصوير خودآگاه من» را لمس كنيد." + "\n")

test1_answer_complete = "تبريك! شما آزمون تصوير خودآگاه من را به پايان رسانديد." + "\n\n"
test1_answer_complete += (
emoj(':small_blue_diamond:') * 2 + emoj(':large_blue_diamond:') + emoj(':small_blue_diamond:') * 2 + ' ')
test1_answer_complete += (
emoj(':small_blue_diamond:') * 2 + emoj(':large_blue_diamond:') + emoj(':small_blue_diamond:') * 2 + ' ')
test1_answer_complete += (
emoj(':small_blue_diamond:') * 2 + emoj(':large_blue_diamond:') + emoj(':small_blue_diamond:') * 2 + '\n\n')
test1_answer_complete += ("اندكي صبر كنيد تا پاسخ هايتان را به تيم تحليل روان يار برسانم." + emoj(':pray:', True))

test1_result_ready = (emoj(':white_check_mark:', True) + " پاسخ های شما تحلیل و نتایج آزمونتان آماده شد." + "\n\n")
test1_result_ready += (emoj(':gift:', True) + " هر کدام از جعبه ها، یک جنبه از شخصیت شما را نشان می دهد." + "\n")
test1_result_ready += "با لمس کردن هر یک، میتوانید آنها را باز کنید."

help_msg = "«تنها محدودیت‌های سر راه شما، همان‌هایی هستند که خودتان به خود تحمیل می‌کنید.»" + "\n\n"
help_msg += (emoj(':bust_in_silhouette:') + " وین دایر" + "\n\n")
help_msg += ("اولین گام در مسیر پیشرفت و تعالی فردی، شناخت خود است." + "\n")
help_msg += (
    "منظور از خودشناسی، این نیست که بدانیم رنگ مورد علاقه‌‌مان چیست یا از خوردن چه غذایی لذت می‌بریم؛ منظور کمی عمیق‌تر از این‌هاست." + "\n")
help_msg += (
    "شناخت احساسات، علایق، نقاط قوت و ضعف، حالات روحی، واکنش‌ها، آنچه ما را آزار می‌دهد و ... برای خودشناسی شروع خوبی است." + "\n\n")
help_msg += (emoj(':triangular_flag_on_post:') + "چرا باید خودمان را بهتر بشناسیم؟" + "\n\n")
help_msg += ("چون:" + "\n\n")
help_msg += (emoj(':small_blue_diamond:') +
             " اهدافمان را واقع بینانه، با توجه به خودِ واقعی‌مان، با شناخت استعدادها و توانایی‌هایمان تعیین می‌کنیم؛ پس به آن‌ها می‌رسیم و نهایتاً زندگی‌مان پر از دست‌یافته‌ها و موفقیت‌هایمان خواهدبود." + "\n")
help_msg += (emoj(':small_blue_diamond:') +
             " می‌دانیم در موقعیت‌های مختلف، نسبت به اتفاقات و رویدادها، چه واکنشی نشان خواهیم داد؛ و البته این موقعیت‌ها چه اثری بر حالات مغز و روح ما (همان موود و حال) می‌گذارند." + "\n")
help_msg += (emoj(':small_blue_diamond:') +
             " در ارتباط با همسر، خانواده، دوستان و همکارانمان رفتارهای درست‌تری از خود بروز می‌دهیم." + "\n")
help_msg += (emoj(':small_blue_diamond:') +
             " در زندگی تصمیمات بهتری می‌‌گیریم؛ پس زندگی فردی، مشترک و شغلی بهتری خواهیم داشت." + "\n\n\n")
help_msg += (emoj(':white_check_mark:', True) +
             " حالا که می‌دانیم خودشناسی چه اثری بر زندگی ما دارد، آماده‌ایم برای اولین گام..." + "\n")

help_message = (
    emoj(':vertical_traffic_light:') +
    "راهنما:" + "\n\n" +
    emoj(':small_blue_diamond:') +
    "دكمه «آزمون تصوير خودآگاه من» را لمس کنید و با تصوير ذهنتان از خود آشنا شويد." + "\n\n" +
    emoj(':small_blue_diamond:') +
    "با زدن دکمه «حساب من»، وارد اين منو شده و می توانيد با لمس دکمه «مشخصات من»، اطلاعاتتان را ویرایش کنید." + "\n\n" +
    emoj(':small_blue_diamond:') +
    "در قسمت «حساب من» با لمس دكمه «عضويت»، از وضعيت اشتراكتان در روان يار مطلع شويد." + "\n\n" +
    emoj(':small_blue_diamond:') +
    "با لمس «بازگشت به منوی اصلی» در هر قسمت از ربات، به منوی اصلی باز خواهید گشت." + "\n\n\n" +
    emoj(':high_brightness:', True) +
    " تیم روان‌یار، همراه شما " +
    emoj(':high_brightness:', True)
)

fill_info = '%s\n%s' % ('برای شروع لطفا جنسیت و سن خود را برای من ارسال کنید.',
                        'اطمینان داشته باشید که تمام اطلاعاتی که ارسال می‌کنید، هیچ کجا انتشار پیدا نمی‌کند و صرفاً برای دقیق‌تر شدن نتیجه آزمون است.')
box_opened = 'ابعاد دیگر شخصیت خود را کشف کنید.'
invalid_input = 'پاسخ نامعتبر است.'

profile_gender_options = dict()
profile_gender_options['مرد'] = 'M'
profile_gender_options['زن'] = 'F'
